MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8M1AHECBD/mcu.h
    union
    {
        __IOM uint8_t VBTBKR102;       /*!< (@ 0x00000D66) VBATT Backup Register 102                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR102_b;
    };

    union
    {
        __IOM uint8_t VBTBKR103;       /*!< (@ 0x00000D67) VBATT Backup Register 103                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR103_b;
    };

    union
    {
        __IOM uint8_t VBTBKR104;       /*!< (@ 0x00000D68) VBATT Backup Register 104                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR104_b;
    };

    union
    {
        __IOM uint8_t VBTBKR105;       /*!< (@ 0x00000D69) VBATT Backup Register 105                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR105_b;
    };

    union
    {
        __IOM uint8_t VBTBKR106;       /*!< (@ 0x00000D6A) VBATT Backup Register 106                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR106_b;
    };

    union
    {
        __IOM uint8_t VBTBKR107;       /*!< (@ 0x00000D6B) VBATT Backup Register 107                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR107_b;
    };

    union
    {
        __IOM uint8_t VBTBKR108;       /*!< (@ 0x00000D6C) VBATT Backup Register 108                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR108_b;
    };

    union
    {
        __IOM uint8_t VBTBKR109;       /*!< (@ 0x00000D6D) VBATT Backup Register 109                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR109_b;
    };

    union
    {
        __IOM uint8_t VBTBKR110;       /*!< (@ 0x00000D6E) VBATT Backup Register 110                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR110_b;
    };

    union
    {
        __IOM uint8_t VBTBKR111;       /*!< (@ 0x00000D6F) VBATT Backup Register 111                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR111_b;
    };

    union
    {
        __IOM uint8_t VBTBKR112;       /*!< (@ 0x00000D70) VBATT Backup Register 112                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR112_b;
    };

    union
    {
        __IOM uint8_t VBTBKR113;       /*!< (@ 0x00000D71) VBATT Backup Register 113                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR113_b;
    };

    union
    {
        __IOM uint8_t VBTBKR114;       /*!< (@ 0x00000D72) VBATT Backup Register 114                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR114_b;
    };

    union
    {
        __IOM uint8_t VBTBKR115;       /*!< (@ 0x00000D73) VBATT Backup Register 115                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR115_b;
    };

    union
    {
        __IOM uint8_t VBTBKR116;       /*!< (@ 0x00000D74) VBATT Backup Register 116                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR116_b;
    };

    union
    {
        __IOM uint8_t VBTBKR117;       /*!< (@ 0x00000D75) VBATT Backup Register 117                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR117_b;
    };

    union
    {
        __IOM uint8_t VBTBKR118;       /*!< (@ 0x00000D76) VBATT Backup Register 118                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR118_b;
    };

    union
    {
        __IOM uint8_t VBTBKR119;       /*!< (@ 0x00000D77) VBATT Backup Register 119                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR119_b;
    };

    union
    {
        __IOM uint8_t VBTBKR120;       /*!< (@ 0x00000D78) VBATT Backup Register 120                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR120_b;
    };

    union
    {
        __IOM uint8_t VBTBKR121;       /*!< (@ 0x00000D79) VBATT Backup Register 121                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR121_b;
    };

    union
    {
        __IOM uint8_t VBTBKR122;       /*!< (@ 0x00000D7A) VBATT Backup Register 122                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR122_b;
    };

    union
    {
        __IOM uint8_t VBTBKR123;       /*!< (@ 0x00000D7B) VBATT Backup Register 123                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR123_b;
    };

    union
    {
        __IOM uint8_t VBTBKR124;       /*!< (@ 0x00000D7C) VBATT Backup Register 124                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR124_b;
    };

    union
    {
        __IOM uint8_t VBTBKR125;       /*!< (@ 0x00000D7D) VBATT Backup Register 125                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR125_b;
    };

    union
    {
        __IOM uint8_t VBTBKR126;       /*!< (@ 0x00000D7E) VBATT Backup Register 126                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR126_b;
    };

    union
    {
        __IOM uint8_t VBTBKR127;       /*!< (@ 0x00000D7F) VBATT Backup Register 127                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR127_b;
    };
} R_SYSTEM_Type;                       /*!< Size = 3456 (0xd80)                                                       */

/* =========================================================================================================================== */
/* ================                                         R_TSN_CAL                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN_CAL)
 */

typedef struct                         /*!< (@ 0x4011B17C) R_TSN_CAL Structure                                        */
{
    union
    {
        __IM uint32_t TSCDR;           /*!< (@ 0x00000000) Temperature Sensor 32 bit Calibration Data Register        */

        struct
        {
            __IM uint32_t TSCDR : 32;  /*!< [31..0] The 32 bit TSCDR register stores temperature sensor
                                        *   calibration converted value.                                              */
        } TSCDR_b;
    };
} R_TSN_CAL_Type;                      /*!< Size = 4 (0x4)                                                            */

/* =========================================================================================================================== */
/* ================                                        R_TSN_CTRL                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN_CTRL)
 */

typedef struct                         /*!< (@ 0x40235000) R_TSN_CTRL Structure                                       */
{
    union
    {
        __IOM uint8_t TSCR;            /*!< (@ 0x00000000) Temperature Sensor Control Register                        */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t TSOE : 1;    /*!< [4..4] Temperature Sensor Enable                                          */
            uint8_t            : 2;
            __IOM uint8_t TSEN : 1;    /*!< [7..7] Temperature Sensor Output Enable                                   */
        } TSCR_b;
    };
} R_TSN_CTRL_Type;                     /*!< Size = 1 (0x1)                                                            */

/* =========================================================================================================================== */
/* ================                                         R_USB_FS0                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief USB 2.0 Module (R_USB_FS0)
 */

typedef struct                         /*!< (@ 0x40250000) R_USB_FS0 Structure                                        */
{
    union
    {
        __IOM uint16_t SYSCFG;         /*!< (@ 0x00000000) System Configuration Control Register                      */

        struct
        {
            __IOM uint16_t USBE  : 1;  /*!< [0..0] USB Operation Enable                                               */
            uint16_t             : 2;
            __IOM uint16_t DMRPU : 1;  /*!< [3..3] D- Line Resistor Control                                           */
            __IOM uint16_t DPRPU : 1;  /*!< [4..4] D+ Line Resistor Control                                           */
            __IOM uint16_t DRPD  : 1;  /*!< [5..5] D+/D- Line Resistor Control                                        */
            __IOM uint16_t DCFM  : 1;  /*!< [6..6] Controller Function Select                                         */
            uint16_t             : 1;
            __IOM uint16_t CNEN  : 1;  /*!< [8..8] CNEN Single End Receiver Enable                                    */
            uint16_t             : 1;
            __IOM uint16_t SCKE  : 1;  /*!< [10..10] USB Clock Enable                                                 */
            uint16_t             : 5;
        } SYSCFG_b;
    };

    union
    {
        __IOM uint16_t BUSWAIT;        /*!< (@ 0x00000002) CPU Bus Wait Register                                      */

        struct
        {
            __IOM uint16_t BWAIT : 4;  /*!< [3..0] CPU Bus Access Wait Specification BWAIT waits (BWAIT+2
                                        *   access cycles)                                                            */
            uint16_t : 12;
        } BUSWAIT_b;
    };

    union
    {
        __IM uint16_t SYSSTS0;         /*!< (@ 0x00000004) System Configuration Status Register 0                     */

        struct
        {
            __IM uint16_t LNST  : 2;   /*!< [1..0] USB Data Line Status Monitor                                       */
            __IM uint16_t IDMON : 1;   /*!< [2..2] External ID0 Input Pin Monitor                                     */
            uint16_t            : 2;
            __IM uint16_t SOFEA : 1;   /*!< [5..5] SOF Active Monitor While Host Controller Function is
                                        *   Selected.                                                                 */
            __IM uint16_t HTACT  : 1;  /*!< [6..6] USB Host Sequencer Status Monitor                                  */
            uint16_t             : 7;
            __IM uint16_t OVCMON : 2;  /*!< [15..14] External USB0_OVRCURA/ USB0_OVRCURB Input Pin MonitorThe
                                        *   OCVMON[1] bit indicates the status of the USBHS_OVRCURA
                                        *   pin. The OCVMON[0] bit indicates the status of the USBHS_OVRCURB
                                        *   pin.                                                                      */
        } SYSSTS0_b;
    };

    union
    {
        __IM uint16_t PLLSTA;          /*!< (@ 0x00000006) PLL Status Register                                        */

        struct
        {
            __IM uint16_t PLLLOCK : 1; /*!< [0..0] PLL Lock Flag                                                      */
            uint16_t              : 15;
        } PLLSTA_b;
    };

    union
    {
        __IOM uint16_t DVSTCTR0;        /*!< (@ 0x00000008) Device State Control Register 0                            */

        struct
        {
            __IM uint16_t RHST     : 3; /*!< [2..0] USB Bus Reset Status                                               */
            uint16_t               : 1;
            __IOM uint16_t UACT    : 1; /*!< [4..4] USB Bus Enable                                                     */
            __IOM uint16_t RESUME  : 1; /*!< [5..5] Resume Output                                                      */
            __IOM uint16_t USBRST  : 1; /*!< [6..6] USB Bus Reset Output                                               */
            __IOM uint16_t RWUPE   : 1; /*!< [7..7] Wakeup Detection Enable                                            */
            __IOM uint16_t WKUP    : 1; /*!< [8..8] Wakeup Output                                                      */
            __IOM uint16_t VBUSEN  : 1; /*!< [9..9] USB_VBUSEN Output Pin Control                                      */
            __IOM uint16_t EXICEN  : 1; /*!< [10..10] USB_EXICEN Output Pin Control                                    */
            __IOM uint16_t HNPBTOA : 1; /*!< [11..11] Host Negotiation Protocol (HNP) Control This bit is
                                         *   used when switching from device B to device A while in
                                         *   OTG mode. If the HNPBTOA bit is 1, the internal function
                                         *   control keeps the suspended state until the HNP processing
                                         *   ends even though SYSCFG.DPRPU = 0 or SYSCFG.DCFM = 1 is
                                         *   set.                                                                      */
            uint16_t : 4;
        } DVSTCTR0_b;
    };
    __IM uint16_t RESERVED;

    union
    {
        __IOM uint16_t TESTMODE;       /*!< (@ 0x0000000C) USB Test Mode Register                                     */

        struct
        {
            __IOM uint16_t UTST : 4;   /*!< [3..0] Test Mode                                                          */
            uint16_t            : 12;
        } TESTMODE_b;
    };
    __IM uint16_t RESERVED1;
    __IM uint32_t RESERVED2;

    union
    {
        __IOM uint32_t CFIFO;          /*!< (@ 0x00000014) CFIFO Port Register                                        */

        struct
        {
            union
            {
                __IOM uint16_t CFIFOL;  /*!< (@ 0x00000014) CFIFO Port Register L                                      */
                __IOM uint8_t  CFIFOLL; /*!< (@ 0x00000014) CFIFO Port Register LL                                     */
            };

            union
            {
                __IOM uint16_t CFIFOH; /*!< (@ 0x00000016) CFIFO Port Register H                                      */

                struct
                {
                    __IM uint8_t  RESERVED3;
                    __IOM uint8_t CFIFOHH; /*!< (@ 0x00000017) CFIFO Port Register HH                                     */
                };
            };
        };
    };

    union
    {
        __IOM uint32_t D0FIFO;         /*!< (@ 0x00000018) D0FIFO Port Register                                       */

        struct
        {
            union
            {
                __IOM uint16_t D0FIFOL;  /*!< (@ 0x00000018) D0FIFO Port Register L                                     */
                __IOM uint8_t  D0FIFOLL; /*!< (@ 0x00000018) D0FIFO Port Register LL                                    */
            };

            union
            {
                __IOM uint16_t D0FIFOH; /*!< (@ 0x0000001A) D0FIFO Port Register H                                     */

                struct
                {
                    __IM uint8_t  RESERVED4;
                    __IOM uint8_t D0FIFOHH; /*!< (@ 0x0000001B) D0FIFO Port Register HH                                    */
                };
            };
        };
    };

    union
    {
        __IOM uint32_t D1FIFO;         /*!< (@ 0x0000001C) D1FIFO Port Register                                       */

        struct
        {
            union
            {
                __IOM uint16_t D1FIFOL;  /*!< (@ 0x0000001C) D1FIFO Port Register L                                     */
                __IOM uint8_t  D1FIFOLL; /*!< (@ 0x0000001C) D1FIFO Port Register LL                                    */
            };

            union
            {
                __IOM uint16_t D1FIFOH; /*!< (@ 0x0000001E) D1FIFO Port Register H                                     */

                struct
                {
                    __IM uint8_t  RESERVED5;
                    __IOM uint8_t D1FIFOHH; /*!< (@ 0x0000001F) D1FIFO Port Register HH                                    */
                };
            };
        };
    };

    union
    {
        __IOM uint16_t CFIFOSEL;        /*!< (@ 0x00000020) CFIFO Port Select Register                                 */

        struct
        {
            __IOM uint16_t CURPIPE : 4; /*!< [3..0] CFIFO Port Access Pipe Specification                               */
            uint16_t               : 1;
            __IOM uint16_t ISEL    : 1; /*!< [5..5] CFIFO Port Access Direction When DCP is Selected                   */
            uint16_t               : 2;
            __IOM uint16_t BIGEND  : 1; /*!< [8..8] CFIFO Port Endian Control                                          */
            uint16_t               : 1;
            __IOM uint16_t MBW     : 2; /*!< [11..10] CFIFO Port Access Bit Width                                      */
            uint16_t               : 2;
            __IOM uint16_t REW     : 1; /*!< [14..14] Buffer Pointer Rewind                                            */
            __IOM uint16_t RCNT    : 1; /*!< [15..15] Read Count Mode                                                  */
        } CFIFOSEL_b;
    };

    union
    {
        __IOM uint16_t CFIFOCTR;       /*!< (@ 0x00000022) CFIFO Port Control Register                                */

        struct
        {
            __IM uint16_t DTLN : 12;   /*!< [11..0] Receive Data LengthIndicates the length of the receive
                                        *   data.                                                                     */
            uint16_t            : 1;
            __IM uint16_t  FRDY : 1;   /*!< [13..13] FIFO Port Ready                                                  */
            __OM uint16_t  BCLR : 1;   /*!< [14..14] CPU Buffer ClearNote: Only 0 can be read.                        */
            __IOM uint16_t BVAL : 1;   /*!< [15..15] Buffer Memory Valid Flag                                         */
        } CFIFOCTR_b;
    };
    __IM uint32_t RESERVED6;

    union
    {
        __IOM uint16_t D0FIFOSEL;       /*!< (@ 0x00000028) D0FIFO Port Select Register                                */

        struct
        {
            __IOM uint16_t CURPIPE : 4; /*!< [3..0] FIFO Port Access Pipe Specification                                */
            uint16_t               : 4;
            __IOM uint16_t BIGEND  : 1; /*!< [8..8] FIFO Port Endian Control                                           */
            uint16_t               : 1;
            __IOM uint16_t MBW     : 2; /*!< [11..10] FIFO Port Access Bit Width                                       */
            __IOM uint16_t DREQE   : 1; /*!< [12..12] DMA/DTC Transfer Request Enable                                  */
            __IOM uint16_t DCLRM   : 1; /*!< [13..13] Auto Buffer Memory Clear Mode Accessed after Specified
                                         *   Pipe Data is Read                                                         */
            __OM uint16_t  REW  : 1;    /*!< [14..14] Buffer Pointer RewindNote: Only 0 can be read.                   */
            __IOM uint16_t RCNT : 1;    /*!< [15..15] Read Count Mode                                                  */
        } D0FIFOSEL_b;
    };

    union
    {
        __IOM uint16_t D0FIFOCTR;      /*!< (@ 0x0000002A) D0FIFO Port Control Register                               */

        struct
        {
            __IM uint16_t DTLN : 12;   /*!< [11..0] Receive Data LengthIndicates the length of the receive
                                        *   data.                                                                     */
            uint16_t            : 1;
            __IM uint16_t  FRDY : 1;   /*!< [13..13] FIFO Port Ready                                                  */
            __IOM uint16_t BCLR : 1;   /*!< [14..14] CPU Buffer ClearNote: Only 0 can be read.                        */
            __IOM uint16_t BVAL : 1;   /*!< [15..15] Buffer Memory Valid Flag                                         */
        } D0FIFOCTR_b;
    };

    union
    {
        __IOM uint16_t D1FIFOSEL;       /*!< (@ 0x0000002C) D1FIFO Port Select Register                                */

