MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8M1AHECBD/mcu.h
typedef struct                           /*!< (@ 0x40268000) R_XSPI0 Structure                                          */
{
    union
    {
        __IOM uint32_t WRAPCFG;          /*!< (@ 0x00000000) xSPI Wrapper Configuration register                        */

        struct
        {
            __IOM uint32_t CKSFTCS0 : 5; /*!< [4..0] CK shift for slave0                                                */
            uint32_t                : 3;
            __IOM uint32_t DSSFTCS0 : 5; /*!< [12..8] DS shift for slave0                                               */
            uint32_t                : 3;
            __IOM uint32_t CKSFTCS1 : 5; /*!< [20..16] CK shift for slave1                                              */
            uint32_t                : 3;
            __IOM uint32_t DSSFTCS1 : 5; /*!< [28..24] DS shift for slave1                                              */
            uint32_t                : 3;
        } WRAPCFG_b;
    };

    union
    {
        __IOM uint32_t COMCFG;              /*!< (@ 0x00000004) xSPI Common Configuration register                         */

        struct
        {
            __IOM uint32_t ARBMD       : 2; /*!< [1..0] Channel arbitration mode                                           */
            uint32_t                   : 2;
            __IOM uint32_t ECSINTOUTEN : 2; /*!< [5..4] ECS/INT Output Enable                                              */
            uint32_t                   : 10;
            __IOM uint32_t OEASTEX     : 1; /*!< [16..16] Output Enable Asserting extension                                */
            __IOM uint32_t OENEGEX     : 1; /*!< [17..17] Output Enable Negating extension                                 */
            uint32_t                   : 14;
        } COMCFG_b;
    };

    union
    {
        __IOM uint32_t BMCFGCH[2];         /*!< (@ 0x00000008) xSPI Bridge Map Configuration register                     */

        struct
        {
            __IOM uint32_t WRMD    : 1;    /*!< [0..0] AHB Write Response mode                                            */
            uint32_t               : 6;
            __IOM uint32_t MWRCOMB : 1;    /*!< [7..7] Memory Write Combination mode                                      */
            __IOM uint32_t MWRSIZE : 8;    /*!< [15..8] Memory Write Size                                                 */
            __IOM uint32_t PREEN   : 1;    /*!< [16..16] Prefetch enable                                                  */
            uint32_t               : 7;
            __IOM uint32_t CMBTIM  : 8;    /*!< [31..24] Combination timer                                                */
        } BMCFGCH_b[2];
    };
    __IOM R_XSPI0_CMCFGCS_Type CMCFGCS[2]; /*!< (@ 0x00000010) xSPI Command Map Configuration registers                   */
    __IM uint32_t              RESERVED[8];

    union
    {
        __IOM uint32_t LIOCFGCS[2];        /*!< (@ 0x00000050) xSPI Link I/O Configuration register CS[0..1]              */

        struct
        {
            __IOM uint32_t PRTMD     : 10; /*!< [9..0] Protocol mode                                                      */
            __IOM uint32_t LATEMD    : 1;  /*!< [10..10] Latency mode                                                     */
            __IOM uint32_t WRMSKMD   : 1;  /*!< [11..11] Write mask mode                                                  */
            uint32_t                 : 4;
            __IOM uint32_t CSMIN     : 4;  /*!< [19..16] CS minimum idle term                                             */
            __IOM uint32_t CSASTEX   : 1;  /*!< [20..20] CS asserting extension                                           */
            __IOM uint32_t CSNEGEX   : 1;  /*!< [21..21] CS negating extension                                            */
            __IOM uint32_t SDRDRV    : 1;  /*!< [22..22] SDR driving timing                                               */
            __IOM uint32_t SDRSMPMD  : 1;  /*!< [23..23] SDR Sampling mode                                                */
            __IOM uint32_t SDRSMPSFT : 4;  /*!< [27..24] SDR Sampling window shift                                        */
            __IOM uint32_t DDRSMPEX  : 4;  /*!< [31..28] DDR sampling window extend                                       */
        } LIOCFGCS_b[2];
    };

    union
    {
        __IOM uint32_t ABMCFG;         /*!< (@ 0x00000058) xSPI AXI Bridge Map Config                                 */

        struct
        {
            __IOM uint32_t ODRMD : 2;  /*!< [1..0] AXI Transfer Ordering Mode                                         */
            uint32_t             : 14;
            __IOM uint32_t CHSEL : 16; /*!< [31..16] AXI ID to Bridge Channel Select                                  */
        } ABMCFG_b;
    };
    __IM uint32_t RESERVED1;

    union
    {
        __IOM uint32_t BMCTL0;            /*!< (@ 0x00000060) xSPI Bridge Map Control register 0                         */

        struct
        {
            __IOM uint32_t CH0CS0ACC : 2; /*!< [1..0] System bus ch0 to slave0 memory area access enable                 */
            __IOM uint32_t CH0CS1ACC : 2; /*!< [3..2] System bus ch0 to slave1 memory area access enable                 */
            __IOM uint32_t CH1CS0ACC : 2; /*!< [5..4] System bus ch1 to slave0 memory area access enable                 */
            __IOM uint32_t CH1CS1ACC : 2; /*!< [7..6] System bus ch1 to slave1 memory area access enable                 */
            uint32_t                 : 24;
        } BMCTL0_b;
    };

    union
    {
        __OM uint32_t BMCTL1;          /*!< (@ 0x00000064) xSPI Bridge Map Control register 1                         */

        struct
        {
            uint32_t                 : 8;
            __OM uint32_t MWRPUSHCH0 : 1; /*!< [8..8] Memory Write Data Push for ch0                                     */
            __OM uint32_t MWRPUSHCH1 : 1; /*!< [9..9] Memory Write Data Push for ch1                                     */
            __OM uint32_t PBUFCLRCH0 : 1; /*!< [10..10] Prefetch Buffer clear for ch0                                    */
            __OM uint32_t PBUFCLRCH1 : 1; /*!< [11..11] Prefetch Buffer clear for ch1                                    */
            uint32_t                 : 20;
        } BMCTL1_b;
    };

    union
    {
        __IOM uint32_t CMCTLCH[2];        /*!< (@ 0x00000068) xSPI Command Map Control register                          */

        struct
        {
            __IOM uint32_t XIPENCODE : 8; /*!< [7..0] XiP mode enter code                                                */
            __IOM uint32_t XIPEXCODE : 8; /*!< [15..8] XiP mode exit code                                                */
            __IOM uint32_t XIPEN     : 1; /*!< [16..16] XiP mode enable                                                  */
            uint32_t                 : 15;
        } CMCTLCH_b[2];
    };

    union
    {
        __IOM uint32_t CDCTL0;         /*!< (@ 0x00000070) xSPI Command Manual Control register 0                     */

        struct
        {
            __IOM uint32_t TRREQ  : 1; /*!< [0..0] Transaction request                                                */
            __IOM uint32_t PERMD  : 1; /*!< [1..1] Periodic mode                                                      */
            uint32_t              : 1;
            __IOM uint32_t CSSEL  : 1; /*!< [3..3] Chip select                                                        */
            __IOM uint32_t TRNUM  : 2; /*!< [5..4] Transaction number                                                 */
            uint32_t              : 10;
            __IOM uint32_t PERITV : 5; /*!< [20..16] Periodic transaction interval                                    */
            uint32_t              : 3;
            __IOM uint32_t PERREP : 4; /*!< [27..24] Periodic transaction repeat                                      */
            uint32_t              : 4;
        } CDCTL0_b;
    };

    union
    {
        __IOM uint32_t CDCTL1;          /*!< (@ 0x00000074) xSPI Command Manual Control register 1                     */

        struct
        {
            __IOM uint32_t PEREXP : 32; /*!< [31..0] Periodic transaction expected value                               */
        } CDCTL1_b;
    };

    union
    {
        __IOM uint32_t CDCTL2;          /*!< (@ 0x00000078) xSPI Command Manual Control register 2                     */

        struct
        {
            __IOM uint32_t PERMSK : 32; /*!< [31..0] Periodic transaction masked value                                 */
        } CDCTL2_b;
    };
    __IM uint32_t            RESERVED2;
    __IOM R_XSPI0_CDBUF_Type CDBUF[4];  /*!< (@ 0x00000080) xSPI BUF register                                          */
    __IM uint32_t            RESERVED3[16];

    union
    {
        __IOM uint32_t LPCTL0;         /*!< (@ 0x00000100) xSPI Link Pattern Control register 0                       */

        struct
        {
            __IOM uint32_t PATREQ : 1; /*!< [0..0] Pattern request                                                    */
            uint32_t              : 2;
            __IOM uint32_t CSSEL  : 1; /*!< [3..3] Chip select                                                        */
            __IOM uint32_t XDPIN  : 2; /*!< [5..4] XiP Disable pattern pin                                            */
            uint32_t              : 10;
            __IOM uint32_t XD1LEN : 5; /*!< [20..16] XiP Disable pattern 1st phase length                             */
            uint32_t              : 2;
            __IOM uint32_t XD1VAL : 1; /*!< [23..23] XiP Disable pattern 1st phase value                              */
            __IOM uint32_t XD2LEN : 5; /*!< [28..24] XiP Disable pattern 2nd phase length                             */
            uint32_t              : 2;
            __IOM uint32_t XD2VAL : 1; /*!< [31..31] XiP Disable pattern 2nd phase value                              */
        } LPCTL0_b;
    };

    union
    {
        __IOM uint32_t LPCTL1;         /*!< (@ 0x00000104) xSPI Link Pattern Control register 1                       */

        struct
        {
            __IOM uint32_t PATREQ : 2; /*!< [1..0] Pattern request                                                    */
            uint32_t              : 1;
            __IOM uint32_t CSSEL  : 1; /*!< [3..3] Chip select                                                        */
            __IOM uint32_t RSTREP : 2; /*!< [5..4] Reset pattern repeat                                               */
            uint32_t              : 2;
            __IOM uint32_t RSTWID : 3; /*!< [10..8] Reset pattern width                                               */
            uint32_t              : 1;
            __IOM uint32_t RSTSU  : 3; /*!< [14..12] Reset pattern data output setup time                             */
            uint32_t              : 17;
        } LPCTL1_b;
    };

    union
    {
        __IOM uint32_t LIOCTL;         /*!< (@ 0x00000108) xSPI Link I/O Control register                             */

        struct
        {
            __IOM uint32_t WPCS0  : 1; /*!< [0..0] WP drive for slave 0                                               */
            __IOM uint32_t WPCS1  : 1; /*!< [1..1] WP drive for slave 1                                               */
            uint32_t              : 14;
            __IOM uint32_t RSTCS0 : 1; /*!< [16..16] Reset drive for slave 0                                          */
            __IOM uint32_t RSTCS1 : 1; /*!< [17..17] Reset drive for slave 1                                          */
            uint32_t              : 14;
        } LIOCTL_b;
    };
    __IM uint32_t              RESERVED4[9];
    __IOM R_XSPI0_CCCTLCS_Type CCCTLCS[2]; /*!< (@ 0x00000130) xSPI CS register                                           */
    __IM uint32_t              RESERVED5[4];

    union
    {
        __IM uint32_t VERSTT;          /*!< (@ 0x00000180) xSPI Version register                                      */

        struct
        {
            __IM uint32_t VER : 32;    /*!< [31..0] Version                                                           */
        } VERSTT_b;
    };

    union
    {
        __IM uint32_t COMSTT;             /*!< (@ 0x00000184) xSPI Common Status register                                */

        struct
        {
            __IM uint32_t MEMACCCH0  : 1; /*!< [0..0] Memory access ongoing from ch0                                     */
            __IM uint32_t MEMACCCH1  : 1; /*!< [1..1] Memory access ongoing from ch1                                     */
            uint32_t                 : 2;
            __IM uint32_t PBUFNECH0  : 1; /*!< [4..4] Prefetch Buffer Not Empty for ch0                                  */
            __IM uint32_t PBUFNECH1  : 1; /*!< [5..5] Prefetch Buffer Not Empty for ch1                                  */
            __IM uint32_t WRBUFNECH0 : 1; /*!< [6..6] Write Buffer Not Empty for ch0                                     */
            __IM uint32_t WRBUFNECH1 : 1; /*!< [7..7] Write Buffer Not Empty for ch1                                     */
            uint32_t                 : 8;
            __IM uint32_t ECSCS0     : 1; /*!< [16..16] ECS monitor for slave0                                           */
            __IM uint32_t INTCS0     : 1; /*!< [17..17] INT monitor for slave0                                           */
            __IM uint32_t RSTOCS0    : 1; /*!< [18..18] RSTO monitor for slave0                                          */
            uint32_t                 : 1;
            __IM uint32_t ECSCS1     : 1; /*!< [20..20] ECS monitor for slave1                                           */
            __IM uint32_t INTCS1     : 1; /*!< [21..21] INT monitor for slave1                                           */
            __IM uint32_t RSTOCS1    : 1; /*!< [22..22] RSTO monitor for slave1                                          */
            uint32_t                 : 9;
        } COMSTT_b;
    };

    union
    {
        __IM uint32_t CASTTCS[2];      /*!< (@ 0x00000188) xSPI Calibration Status register                           */

        struct
        {
            __IM uint32_t CASUC : 32;  /*!< [31..0] Calibration Success                                               */
        } CASTTCS_b[2];
    };

    union
    {
        __IM uint32_t INTS;              /*!< (@ 0x00000190) xSPI Interrupt Status register                             */

        struct
        {
            __IM uint32_t CMDCMP    : 1; /*!< [0..0] Command Completed                                                  */
            __IM uint32_t PATCMP    : 1; /*!< [1..1] Pattern Completed                                                  */
            __IM uint32_t INICMP    : 1; /*!< [2..2] Initial Sequence Completed                                         */
            __IM uint32_t PERTO     : 1; /*!< [3..3] Periodic transaction timeout                                       */
            __IM uint32_t DSTOCS0   : 1; /*!< [4..4] DS timeout for slave0                                              */
            __IM uint32_t DSTOCS1   : 1; /*!< [5..5] DS timeout for slave1                                              */
            uint32_t                : 2;
            __IM uint32_t ECSCS0    : 1; /*!< [8..8] ECC error detection for slave0                                     */
            __IM uint32_t ECSCS1    : 1; /*!< [9..9] ECC error detection for slave1                                     */
            uint32_t                : 2;
            __IM uint32_t INTCS0    : 1; /*!< [12..12] Interrupt detection for slave0                                   */
            __IM uint32_t INTCS1    : 1; /*!< [13..13] Interrupt detection for slave1                                   */
            uint32_t                : 2;
            __IM uint32_t BRGOFCH0  : 1; /*!< [16..16] Bridge Buffer overflow for CH0                                   */
            __IM uint32_t BRGOFCH1  : 1; /*!< [17..17] Bridge Buffer overflow for CH1                                   */
            __IM uint32_t BRGUFCH0  : 1; /*!< [18..18] Bridge Buffer underflow for CH0                                  */
            __IM uint32_t BRGUFCH1  : 1; /*!< [19..19] Bridge Buffer underflow for CH1                                  */
            __IM uint32_t BUSERRCH0 : 1; /*!< [20..20] AHB bus error for CH0                                            */
            __IM uint32_t BUSERRCH1 : 1; /*!< [21..21] AHB bus error for CH1                                            */
            uint32_t                : 6;
            __IM uint32_t CAFAILCS0 : 1; /*!< [28..28] Calibration failed for slave0                                    */
            __IM uint32_t CAFAILCS1 : 1; /*!< [29..29] Calibration failed for slave1                                    */
            __IM uint32_t CASUCCS0  : 1; /*!< [30..30] Calibration success for slave0                                   */
            __IM uint32_t CASUCCS1  : 1; /*!< [31..31] Calibration success for slave1                                   */
        } INTS_b;
    };

    union
    {
        __OM uint32_t INTC;               /*!< (@ 0x00000194) xSPI Interrupt Clear register                              */

        struct
        {
            __OM uint32_t CMDCMPC    : 1; /*!< [0..0] Command Completed interrupt clear                                  */
            __OM uint32_t PATCMPC    : 1; /*!< [1..1] Pattern Completed interrupt clear                                  */
            __OM uint32_t INICMPC    : 1; /*!< [2..2] Initial Sequence Completed interrupt clear                         */
            __OM uint32_t PERTOC     : 1; /*!< [3..3] Periodic transaction timeout interrupt clear                       */
            __OM uint32_t DSTOCS0C   : 1; /*!< [4..4] DS timeout for slave0 interrupt clear                              */
            __OM uint32_t DSTOCS1C   : 1; /*!< [5..5] DS timeout for slave1 interrupt clear                              */
            uint32_t                 : 2;
            __OM uint32_t ECSCS0C    : 1; /*!< [8..8] ECC error detection for slave0 interrupt clear                     */
            __OM uint32_t ECSCS1C    : 1; /*!< [9..9] ECC error detection for slave1 interrupt clear                     */
            uint32_t                 : 2;
            __OM uint32_t INTCS0C    : 1; /*!< [12..12] Interrupt detection for slave0 interrupt clear                   */
            __OM uint32_t INTCS1C    : 1; /*!< [13..13] Interrupt detection for slave1 interrupt clear                   */
            uint32_t                 : 2;
            __OM uint32_t BRGOFCH0C  : 1; /*!< [16..16] Bridge Buffer overflow for CH0 interrupt clear                   */
            __OM uint32_t BRGOFCH1C  : 1; /*!< [17..17] Bridge Buffer overflow for CH1 interrupt clear                   */
            __OM uint32_t BRGUFCH0C  : 1; /*!< [18..18] Bridge Buffer underflow for CH0 interrupt clear                  */
            __OM uint32_t BRGUFCH1C  : 1; /*!< [19..19] Bridge Buffer underflow for CH1 interrupt clear                  */
            __OM uint32_t BUSERRCH0C : 1; /*!< [20..20] AHB bus error for CH0 interrupt clear                            */
            __OM uint32_t BUSERRCH1C : 1; /*!< [21..21] AHB bus error for CH1 interrupt clear                            */
            uint32_t                 : 6;
            __OM uint32_t CAFAILCS0C : 1; /*!< [28..28] Calibration failed for slave0 interrupt clear                    */
            __OM uint32_t CAFAILCS1C : 1; /*!< [29..29] Calibration failed for slave1 interrupt clear                    */
            __OM uint32_t CASUCCS0C  : 1; /*!< [30..30] Calibration success for slave0 interrupt clear                   */
            __OM uint32_t CASUCCS1C  : 1; /*!< [31..31] Calibration success for slave1 interrupt clear                   */
        } INTC_b;
    };

    union
    {
        __IOM uint32_t INTE;               /*!< (@ 0x00000198) xSPI Interrupt Enable register                             */

        struct
        {
            __IOM uint32_t CMDCMPE    : 1; /*!< [0..0] Command Completed interrupt enable                                 */
            __IOM uint32_t PATCMPE    : 1; /*!< [1..1] Pattern Completed interrupt enable                                 */
            __IOM uint32_t INICMPE    : 1; /*!< [2..2] Initial Sequence Completed interrupt enable                        */
            __IOM uint32_t PERTOE     : 1; /*!< [3..3] Periodic transaction timeout interrupt enable                      */
            __IOM uint32_t DSTOCS0E   : 1; /*!< [4..4] DS timeout for slave0 interrupt enable                             */
            __IOM uint32_t DSTOCS1E   : 1; /*!< [5..5] DS timeout for slave1 interrupt enable                             */
            uint32_t                  : 2;
            __IOM uint32_t ECSCS0E    : 1; /*!< [8..8] ECC error detection for slave0 interrupt enable                    */
            __IOM uint32_t ECSCS1E    : 1; /*!< [9..9] ECC error detection for slave1 interrupt enable                    */
            uint32_t                  : 2;
            __IOM uint32_t INTCS0E    : 1; /*!< [12..12] Interrupt detection for slave0 interrupt enable                  */
            __IOM uint32_t INTCS1E    : 1; /*!< [13..13] Interrupt detection for slave1 interrupt enable                  */
            uint32_t                  : 2;
            __IOM uint32_t BRGOFCH0E  : 1; /*!< [16..16] Bridge Buffer overflow for CH0 interrupt enable                  */
            __IOM uint32_t BRGOFCH1E  : 1; /*!< [17..17] Bridge Buffer overflow for CH1 interrupt enable                  */
            __IOM uint32_t BRGUFCH0E  : 1; /*!< [18..18] Bridge Buffer underflow for CH0 interrupt enable                 */
            __IOM uint32_t BRGUFCH1E  : 1; /*!< [19..19] Bridge Buffer underflow for CH1 interrupt enable                 */
            __IOM uint32_t BUSERRCH0E : 1; /*!< [20..20] AHB bus error for CH0 interrupt enable                           */
            __IOM uint32_t BUSERRCH1E : 1; /*!< [21..21] AHB bus error for CH1 interrupt enable                           */
            uint32_t                  : 6;
            __IOM uint32_t CAFAILCS0E : 1; /*!< [28..28] Calibration failed for slave0 interrupt enable                   */
            __IOM uint32_t CAFAILCS1E : 1; /*!< [29..29] Calibration failed for slave1 interrupt enable                   */
            __IOM uint32_t CASUCCS0E  : 1; /*!< [30..30] Calibration success for slave0 interrupt enable                  */
            __IOM uint32_t CASUCCS1E  : 1; /*!< [31..31] Calibration success for slave1 interrupt enable                  */
        } INTE_b;
    };
} R_XSPI0_Type;                            /*!< Size = 412 (0x19c)                                                        */

/* =========================================================================================================================== */
/* ================                                           R_CEU                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Capture Engine Unit (R_CEU)
 */

typedef struct                         /*!< (@ 0x40348000) R_CEU Structure                                            */
{
    union
    {
        __IOM uint32_t CAPSR;          /*!< (@ 0x00000000) Capture Start Register                                     */

